[
    {
        "rank": "100",
        "player_name": "RJ Barrett",
        "summary": "2024 NBA Rank: 53 Barrett averaged a career-high 21.1 points per game last season for the Raptors, his first full season playing for his hometown team after being acquired by Toronto midway through the 2023-24 campaign. Barrett's role entering this season is a bit in flux; however, a goal for the team is to combine his talents with the newly acquired Brandon Ingram and ascending star Scottie Barnes. -- Tim Bontemps Signature stat: Last season, Barrett joined Pascal Siakam to become the only players in Raptors history to average 20 points, five rebounds and five assists. Fantasy projection: 20.9 PTS, 6.1 REB, 4.9 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "99",
        "player_name": "Stephon Castle",
        "summary": "2024 NBA Rank: Unranked The No. 4 pick of the 2024 NBA draft, Castle unwittingly applied a little pressure on incoming No. 2 pick Dylan Harper: He became San Antonio's second consecutive player to win NBA Rookie of the Year and the fourth Spur to capture the honor, joining Victor Wembanyama, Tim Duncan and David Robinson. Castle started 47 games as a rookie and led his draft class in total points (1,190), made field goals (423) and steals (74). The runner-up in last season's Slam Dunk Contest, Castle is San Antonio's stickiest perimeter defender. -- Michael C. Wright Signature stat: On his way to winning Rookie of the Year, Castle had 26 20-point games last season, most among rookies and the fifth-most by a rookie in Spurs history. Fantasy projection: 15.8 PTS, 3.9 REB, 4.4 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "98",
        "player_name": "Walker Kessler",
        "summary": "2024 NBA Rank: Unranked The Jazz have made it clear the fourth-year center is part of their future by consistently rebuffing trade calls from inquiring teams. From the moment Kessler came into the league, he has been an elite shot blocker and defensive presence. The issue is that Utah is still a perennial lottery team, so it's hard to evaluate Kessler's growth when his games played has declined each season with the Jazz jockeying for draft positioning. Kessler started all 58 games he played last season and averaged career highs in points (11.1), rebounds (12.2) and assists (1.7). -- Ramona Shelburne Signature stat: Kessler is the first player to average 2-plus blocks in each of his first three seasons since Tim Duncan (1997-2000). Fantasy projection: 10.6 PTS, 11.2 REB, 2.5 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "97",
        "player_name": "Payton Pritchard",
        "summary": "2024 NBA Rank: Unranked The reigning Sixth Man of the Year is coming off a career-best 14.3 points per game, but the Celtics are about to enter a gap year with superstar Jayson Tatum (Achilles) sidelined. Which could mean, ultimately, that there should be more of an opportunity for Pritchard, especially with veteran guard Jrue Holiday traded to Portland. Pritchard could even break his way into the starting lineup alongside Derrick White and Jaylen Brown, a potentially potent trio for Boston. The Celtics like to say no one on the team works harder than Pritchard, and, given the circumstances, this could be the season in which he really blossoms. -- Baxter Holmes Signature stat: Pritchard made 246 3s off the bench last season-- most in a season in NBA history. Fantasy projection: 13.7 PTS, 3.8 REB, 3.6 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "96",
        "player_name": "Nickeil Alexander-Walker",
        "summary": "2024 NBA Rank: Unranked The Hawks strengthened their second unit by adding Alexander-Walker, who averaged 9.4 points and 38% shooting for the Wolves last season. Alexander-Walker can provide a spark for the Hawks with his offense. He gives them another capable defender and perhaps can help at backup point guard, as well. With Dyson Daniels and Alexander-Walker, the Hawks' perimeter defense could be a pain for opposing wings. His durability is a big plus as Alexander-Walker has played all 82 games in two straight seasons. -- Ohm Youngmisuk Signature stat: Alexander-Walker is one of five players to play 82 games in each of past two seasons (joins Barnes, Bridges, Green, Hield). Fantasy projection: 9.3 PTS, 3.1 REB, 2.8 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "95",
        "player_name": "P.J. Washington",
        "summary": "2024 NBA Rank: Unranked It remains to be determined whether Washington starts or comes off the bench this season, but he has established himself as an essential part of the Mavs' core, as evidenced by the four-year, $89 million contract extension he recently signed. His athleticism and versatility are valued in Dallas, which relies on the 6-foot-7 Washington as a primary defender from point guards to power forwards. He averaged a career-best 7.8 rebounds per game and was one of only eight players in the league to average at least one steal and one block (minimum 50 games). -- Tim MacMahon Signature stat: Washington is one of two players with 50-plus steals and 50-plus blocks in each of the past five seasons (with Antetokounmpo). Fantasy projection: 12.9 PTS, 6.2 REB, 2.0 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "94",
        "player_name": "Devin Vassell",
        "summary": "2024 NBA Rank: Unranked Recovery from offseason foot surgery and multiple lineup changes contributed to Vassell's failure to produce the type of season both he and the team expected in 2024-25. Despite taking somewhat of a step back offensively, Vassell flashed on occasion, dropping a season-high 37 points during a March victory over Brooklyn in addition to putting together four games with four steals. But inconsistency has been a defining characteristic for Vassell, who has the potential to be a solid two-way player and third or fourth option for a playoff team. -- Wright Signature stat: Vassell is the third Spurs player with 150-plus 3PM in consecutive seasons (joins Patty Mills and Chuck Person). Fantasy projection: 17.0 PTS, 4.0 REB, 3.1 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "93",
        "player_name": "Jakob Poeltl",
        "summary": "2024 NBA Rank: Unranked In his ninth NBA season, Poeltl averaged career highs in points, rebounds and assists while playing a career-high 29.6 MPG. The Raptors rewarded Poeltl with a three-year extension that keeps him under contract through 2029-30. Two factors are keeping Poeltl from ranking higher. Once a premier rim protector with the Spurs, he has only been average in this regard with Toronto. Additionally, Poeltl has missed a combined 57 games the past two seasons, though eight of those last year were due to rest. -- Kevin Pelton Signature stat: Last season, Poeltl averaged a career-high 14.5 PPG, as well as a top-10 FG% on floaters (min. 100 FGA) and layups/dunks (min. 300 FGA). Fantasy projection: 13.8 PTS, 9.4 REB, 1.3 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "92",
        "player_name": "Mitchell Robinson",
        "summary": "2024 NBA Rank: 82 Although he missed much of the season with injuries, Robinson returned just before the postseason and immediately reminded everyone why he's such a devastating threat on the boards. Robinson became a critical part of New York's run to the East finals, eventually replacing Hart in the starting lineup. New York will hope to get Robinson, who has played over 70 games only once in his career, through the season healthy. -- Bontemps Signature stat: Robinson played all 18 playoff games and had 67 offensive rebounds -- most by a Knick in the playoffs since 1994. Fantasy projection: 5.7 PTS, 7.1 REB, 1.2 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "91",
        "player_name": "Jrue Holiday",
        "summary": "2024 NBA Rank: 36 Entering his 17th season, Holiday is back in Portland -- where he was traded in 2023 before being quickly moved to Boston -- and will serve as a veteran leader for a team with a young core. The two-time NBA champion will also help the Trail Blazers' improving defense, which jumped from 23rd in 2023-2024 to 16th last season. But at age 35, it would be unfair to expect Holiday, who is clearly in the winter of a likely Hall of Fame career, to be the force that he once was. Still, for a team that hasn't made the playoffs in four years, Holiday should be a welcomed boost. -- Holmes Signature stat: Holiday is one of three players to win multiple championships since 2020 (with Kentavious Caldwell-Pope and Alex Caruso). Fantasy projection: 12.2 PTS, 4.4 AST, 1.0 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "90",
        "player_name": "Naz Reid",
        "summary": "2024 NBA Rank: 87 Reid followed up his 2023-24 Sixth Man of the Year award with an even more impressive campaign, increasing his scoring (13.5 to 14.2 PPG), rebounding (5.2 to 6.0 RPG) and distributing (1.3 to 2.3 APG) while providing the steady floor spacing at center (37.9% from 3) to open up paint opportunities for Anthony Edwards. After his postseason production dipped -- 10.4 PPG and 4.7 RPG -- and Minnesota lost in the conference finals for the second straight year, the Wolves stayed committed to the 26-year-old big man, signing Reid to a five-year, $125 million extension in June. -- Dave McMenamin Signature stat: Reid made 175 3s last season -- a career-high and most among centers in 2024-25. Fantasy projection: 14.1 PTS, 5.9 REB, 2.0 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "89",
        "player_name": "Andrew Wiggins",
        "summary": "2024 NBA Rank: 90 After being traded to Miami in a high-profile swap for Jimmy Butler, Wiggins averaged 19 points in 17 games -- all starts -- for the Heat, who were swept in the first round by Cleveland. The 2014 No. 1 overall pick is 30, with 11 years in the league, and expectations for him to develop into a superstar have faded. Wiggins appears to be more of a key piece than a centerpiece, but trade rumors continue to swirl about whether Wiggins could be moved during the season. -- Holmes Signature stat: Wiggins' scoring average went up nearly 5 PPG last season. He also took 11.9% of shots from midrange last season, a career low. Fantasy projection: 18.9 PTS, 5.1 REB, 2.7 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "88",
        "player_name": "Zach Edey",
        "summary": "2024 NBA Rank: Unranked The 7-foot-4, 305-pound big man's status for the start of the season is in question as Edey recovers from June ankle surgery, but he proved he could be impactful in a limited role as a rookie. Edey averaged 9.2 points, 8.3 rebounds and 1.3 blocks last season, when he played only 21.5 minutes per game. Only one rookie has ever matched or exceeded that production across the board with a higher effective field goal percentage than Edey's .600. -- MacMahon Signature stat: Edey set 32.9 on-ball screens per game under head coach Thomas Iisalo, versus 13.2 when he was under Taylor Jenkins. Fantasy projection: 10.9 PTS, 9.7 REB, 1.5 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "87",
        "player_name": "Jonas Valanciunas",
        "summary": "2024 NBA Rank: 91 While it was initially unclear whether Valanciunas would stay in the NBA this summer after being acquired by the Nuggets from the Kings, the veteran big will be tasked with lessening the load on Nikola Jokic, who has been leaned on heavily during the regular season. If Valanciunas can do that successfully, the Nuggets will be thrilled. -- Bontemps Signature stat: Valanciunas came off the bench for 60 games last season versus 29 total in his first 12 seasons. Fantasy projection: 10.2 PTS, 7.5 REB, 1.8 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "86",
        "player_name": "Bradley Beal",
        "summary": "2024 NBA Rank: 70 There was a dark cloud over Beal all last season as he played on a $50 million-per-year contract with a no-trade clause on an underperforming team. His numbers were still reasonably good -- he shot 50% for a third straight year -- but he received little credit because of the baggage. If he's the same player this year, now playing on a discount in a different role, the discourse could completely flip with the Clippers. It's a story we've seen before in the NBA. -- Brian Windhorst Signature stat: Last season, Beal averaged his fewest PPG since 2014-15 but was 65% on layups/dunks -- his best since 2013-14. Fantasy projection: 15.4 PTS, 3.1 REB, 3.4 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "85",
        "player_name": "Jaden Ivey",
        "summary": "2024 NBA Rank: Unranked Three years into his NBA career and it's still fair to wonder what exactly to make of Ivey and his long-term fit in Detroit. He played in only 30 games last season before a season-ending injury forced him to watch the team's playoff run from the sidelines. Before the injury, he was showing signs of a breakout, recording 17.6 points per game on 46% shooting (41% from 3), both of which were career highs. But he never got to play out his full potential. Now extension eligible on his rookie contract, Ivey will have something to prove this season: Can he be a major part of Detroit's next playoff run? -- Jamal Collier Signature stat: Last season, Ivey shot 41% on 3s and 46% on catch-and-shoot 3s before his Jan. 1 injury. Fantasy projection: 17.6 PTS, 4.1 REB, 4.4 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "84",
        "player_name": "Tobias Harris",
        "summary": "2024 NBA Rank: Unranked Harris carved out a role for himself to help revitalize the Pistons en route to a playoff berth. At 33 years old, he is one of the veteran leaders, and his 13.7 points, 5.9 rebounds and 47% shooting don't tell the whole story of his total impact. Pistons coach J.B. Bickerstaff often referred to him as the team's \"safety blanket,\" a calming, reliable force on and off the court for one of the league's youngest teams making a turnaround from the bottom of the standings to the postseason. -- Collier Signature stat: Harris shot 66% on layups and dunks last season, his best since 2013-14. He was also 77% on 31 attempts off passes from Cade Cunningham. Fantasy projection: 14.1 PTS, 5.8 REB, 2.3 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "83",
        "player_name": "Jonathan Kuminga",
        "summary": "2024 NBA Rank: Unranked Nothing better summarizes Kuminga's roller coaster tenure with the Warriors than the final three weeks of his fourth season. Steve Kerr pulled him from the rotation before the playoffs because he was failing to fit with the new Jimmy Butler-infused rotation. Kuminga mostly watched from the sidelines as the Warriors snuck past Houston in the first round. But after Steph Curry's hamstring injury, Kuminga was forced into second-round action and exploded into their leading scorer: 20.8 points on 54.3% shooting. That dichotomy further complicates a restricted free agency that remains unsolved. Kuminga's personal ambitions were emboldened by his playoff performance, but the Warriors remain concerned about his fit when the full core is healthy. -- Anthony Slater Signature stat: Kuminga led the Warriors in the paint in the past two seasons with 8.5 PPG last season and 10.0 PG in 2023-24. Fantasy projection: 14.9 PTS, 4. 5 REB, 2.2 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "82",
        "player_name": "Norman Powell",
        "summary": "2024 NBA Rank: Unranked Powell had his best season in his 10th year, when he turned 32. You don't see that often. He thrived in the hole created by Paul George's departure from the Clippers; he is known for being one of the league's hardest workers; and he has turned himself into a multi-faceted offensive weapon. The Heat picked him up on the relative cheap in trade because the Clippers didn't want to pay him, but that might create huge motivation for a big season. -- Windhorst Signature stat: Last season, Powell led the NBA in points per touch and ranked second in eFG% on jumpers (min. 500 attempts). Fantasy projection: 22.0 PTS, 3.4 REB, 2.0 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "81",
        "player_name": "Andrew Nembhard",
        "summary": "2024 NBA Rank: Unranked In each of the past two years, Nembhard's game has gone to another level in the postseason, where he averaged more points, rebounds and assists, while his field goal percentage and 3-point shooting percentages increased (his 33.5% 3PT% in the regular season increased to 47.3 in the postseason). Not to mention the fact that he was Indiana's most relentless defender during the postseason, leading a full court press, slipping through screens and shutting off extra space for opposing ball handlers. With Haliburton sidelined for the season, Nembhard is going to become the team's primary ball handler, which should give him a chance to prove whether those playoff performances can carry over into a full season.-- Collier Signature stat: Last season, Nembhard increased his 3-point percentage by 17.4 points from regular season to playoffs, the largest jump ever (min. 50 3PA). Fantasy projection: 11.8 PTS, 5.8 AST, 1.4 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "80",
        "player_name": "DeMar DeRozan",
        "summary": "2024 NBA Rank: 45 Last March, on a signature move in the mid-range, DeRozan became only the 27th player in NBA history to score 25,000 career points. He is entering his 17th season. In his 16th season, he averaged 22.2 points, his 12th consecutive season of averaging above 20 points per game. DeRozan appeared in 77 games, the 12th time in his career that he has played at least 74 games. DeRozan, 36, remains highly productive and durable, but the defensive question marks and flawed supporting casts have kept him from the biggest stage since his Toronto days. DeRozan has only appeared in five total playoff games since 2019. -- Slater Signature stat: Last season, DeRozan made 293 midrange shots -- 119 more than any other player. He's led the NBA in mid-range FGs in 3 of the past 4 seasons. Fantasy projection: 22.8 PTS, 4.0 REB, 4.7 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "79",
        "player_name": "Onyeka Okongwu",
        "summary": "2024 NBA Rank: Unranked Okongwu became the starter on Jan. 20 and from February on, the center scored in double figures in 27 of his last 33 games of the season. He also had 18 double-doubles during that span. Okongwu and new addition Kristaps Porzingis could be one of the best center tandems in the NBA if Porzingis can stay healthy. With more opportunity and talent on the roster, Okongwu could be poised to average a double-double in the coming season. -- Youngmisuk Signature stat: One of six players last season to average 15 points, 10 rebounds and 55% field goals (minimum 30 games from Jan. 14 to the end of the season). Fantasy projection: 13.3 PTS, 8.9 REB, 1.0 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "78",
        "player_name": "Toumani Camara",
        "summary": "2024 NBA Rank: Unranked During his second season, Camara went from second-round steal to legit building block for the Blazers. Not only did Camara earn All-Defensive second team honors because of his capability to guard all five positions, but he also made strides on offense. Camara shot 37.5% on 3s and averaged 11.3 PPG, forcing opponents to respect him. After the All-Star break, Camara shot an effective 59%, accounting for the added value of 3s. Camara's single best skill might be drawing charges -- a league-high 31 of them, per NBA Advanced Stats. -- Pelton Signature stat: Camara defended the second most All-Stars for 1,080 halfcourt matchups last season. He also drew 91 offensive fouls, the most since 2013-14. Fantasy projection: 11.0 PTS, 5.8 REB, 1.4 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "77",
        "player_name": "Brandon Ingram",
        "summary": "2024 NBA Rank: 40 Somehow, this will mark the 10th season for Ingram. The former No. 2 overall pick played just 18 games last season due to a severe ankle sprain, after which he was traded to Toronto, which signed him to a three-year, $120 million contract extension. He hasn't played a game since Dec. 7, 2024, and his lone All-Star appearance came in 2019-20. But it will be intriguing to see how he plays alongside Scottie Barnes, Immanuel Quickley and RJ Barrett for the foreseeable future. -- Holmes Signature stat: The Raptors ranked last in off-the-dribble jumpers last season. However, Ingram ranked seventh in such makes over the past five seasons. Fantasy projection: 21.8 PTS, 5.3 REB, 5.4 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "76",
        "player_name": "Brandon Miller",
        "summary": "2024 NBA Rank: 68 Miller's promising sophomore season lasted just 27 games before he was sidelined with a torn ligament in his right wrist. Before that, he averaged 21 points and looked like a dynamic playmaker alongside LaMelo Ball. He hasn't played since January, and he'll join a very different roster, with rookies Kon Knueppel and Liam McNeeley, along with veterans Colin Sexton and Mason Plumlee among several offseason additions. While it remains to be seen how he'll fit into the mix, the glimpses he showed before his injury were especially promising, and alongside Ball, Miller should continue to ascend. -- Holmes Signature stat: Miller ended last season with 20 straight games of multiple 3-pointers made, tying the longest streak in the Hornets franchise history. Fantasy projection: 19.5 PTS, 4.6 REB, 3.1 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "75",
        "player_name": "Jaden McDaniels",
        "summary": "2024 NBA Rank: 77 At 6-9, with a near 7-foot wingspan, McDaniels covers a lot of space just by being on the court. And the consistency in which he was available to use his long arms to harass the ball on defense and churn his long legs to score the ball in transition on offense made 2024-25 a career season for the small forward. McDaniels played in all 82 games for the first time in his five years in the league and had his finest postseason yet, averaging playoff bests in points (14.7), rebounds (5.6) and steals (1.3) per game. His 25 points on 11-for-13 shooting in Game 1 of the first round of the playoffs helped the No. 6-seeded Wolves go on to upset the No. 3 Los Angeles Lakers and make it all the way to the conference finals. -- McMenamin Signature stat: Last season, McDaniels was one of five players with 1,000 points, 100 steals and 50 blocks -- joining Gilgeous-Alexander, Anunoby, Daniels and Harden. Fantasy projection: 12.2 PTS, 5.2 REB, 1.3 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "74",
        "player_name": "Jabari Smith Jr.",
        "summary": "2024 NBA Rank: 92 The epitome of homegrown talent in Houston, Smith was rewarded over the offseason with a $122 million rookie extension. Smith provides versatility on defense and floor spacing, not to mention optionality with the big lineups the Rockets will employ throughout the season. Houston drafted Smith No. 3 overall in 2022, and he has played an important role in the team's culture and growth over the years as a starter and reserve near the end of last season and the playoffs. -- Wright Signature stat: Last season, the Rockets went 40-17 with Smith and 12-13 without. When he came off the bench, Houston went 15-3. Fantasy projection: 13.1 PTS, 7.5 REB, 1.3 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "73",
        "player_name": "Dereck Lively II",
        "summary": "2024 NBA Rank: 56 The Mavs believe that Lively, a springy 7-footer with the ability to protect the rim and guard on the perimeter, has the potential to develop into a Defensive Player of the Year. He's a spectacular finisher who has dunked 207 of his 355 career buckets, but Lively likely won't get as many lobs after Luka Doncic's departure. Lively has proven he can be a force when he's on the floor, but he's been limited to a total of 91 games in his two NBA seasons and had offseason foot surgery. -- MacMahon Signature stat: Lively shot 73% on field goals since entering the NBA in 2023 -- the best among players with 400-plus shots over the last two seasons. Fantasy projection: 9.8 PTS, 8.3 REB, 1.7 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "72",
        "player_name": "Zach LaVine",
        "summary": "2024 NBA Rank: 74 After missing 58 games two seasons ago because of nagging foot issues, LaVine resurrected his value with three scorching, healthy months to open last season. The Bulls leveraged that into a deadline deal, roping LaVine's large contract into the De'Aaron Fox three-team trade, sending LaVine to Sacramento. He has two years and $96.4 million left on his deal. He has his defensive flaws and health question marks, but when he plays to his full potential, he's explosive. In 72 games last season split between two teams, he averaged 23.3 points on 51% shooting, making 44.6% of his high volume of 3s. His 239 makes from deep were the eighth most in the NBA. -- Slater Signature stat: He was one of four players (Nikola Jokic, Kevin Durant and Karl-Anthony Towns) to average 20 points, shooting 50% on field goals and 40% 3s last season. Fantasy projection: 23.3 PTS, 4.3 REB, 4.2 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "71",
        "player_name": "Coby White",
        "summary": "2024 NBA Rank: 58 White has emerged as the Bulls' most consistent offensive player during his breakout stretch the past two seasons. Two years ago, the former No. 7 overall pick primarily came off the bench aside from a few spot starts for Chicago. Fast-forward to last season, where he averaged 20.4 points and 4.5 assists on 45% shooting (37% from 3) in 74 games, picking up the gap in production after the team traded away Zach LaVine. White is entering the final season of his contract this season, and he has thoroughly outplayed it, making an extension unlikely and opening up questions about his future in Chicago. -- Collier Signature stat: Last season, he had a career-high 20.4 points per game and made 216 3s -- the most in Bulls' history for a single season. Fantasy projection: 20.9 PTS, 4.2 REB, 4.9 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "70",
        "player_name": "Michael Porter Jr.",
        "summary": "2024 NBA Rank: 89 We're about to find out just how important playing alongside Nikola Jokic was to Porter Jr.'s career. The 6-10 forward played a key role for the Nuggets as a floor spacer next to Jokic and was remarkably durable, playing through injuries like he did in the playoffs with a separated shoulder. But Porter always believed he was capable of more playmaking and shot creating, if given the opportunity, and it looks like he's going to get that chance with the rebuilding Nets after being traded in the offseason. -- Shelburne Signature stat: He had the second-best catch-and-shoot 3-point percentage among 1,000-plus attempts over the past three seasons -- only behind Curry. Fantasy projection: 19.1 PTS, 7.4 REB, 2.1 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "69",
        "player_name": "Josh Hart",
        "summary": "2024 NBA Rank: 61 One of the big questions surrounding Mike Brown's arrival in New York, assuming this roster is healthy, is choosing between Hart and Mitchell Robinson as the fifth starter. Regardless, Hart's lunch pail work ethic and knack for winning plays have already made him a fan favorite, endearing him to the Madison Square Garden crowd in the same way players like John Starks did in past iterations of the franchise. -- Bontemps Signature stat: Last season, he had nine triple-doubles -- the most in a season in Knicks history (passed Walt Frazier, 1968-69). Fantasy projection: 13.0 PTS, 9.4 REB, 5.6 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "68",
        "player_name": "Tyler Herro",
        "summary": "2024 NBA Rank: 76 Last season, Herro bounced back from injury to have his most efficient and best playmaking season, and he was a bright light on a Heat team that endured Jimmy Butler's daily turbulence and Bam Adebayo's overall down season. He'll have to overcome similar hurdles in 2025-26 after undergoing surgery this offseason that will keep him sidelined at the start. There are times when his offense-first and shot-heavy play can feel like empty calories, especially when the Heat had their worst season in a decade. -- Windhorst Signature stat: He is the fourth Heat player to average 20 points, 5 rebounds, 5 assists in a season -- joining Butler, LeBron James and Dwyane Wade. Fantasy projection: 23.6 PTS, 5.2 REB, 5.4 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "67",
        "player_name": "Cameron Johnson",
        "summary": "2024 NBA Rank: Unranked Playing for a rebuilding Brooklyn Nets team, Johnson was an unlikely No. 1 option on offense, posting a career-high 23% usage rate while simultaneously improving his efficiency. Johnson made 58% of 2-point attempts and a career-high 2.8 3s per game, producing the best true shooting percentage of his career (.632). Dealt to Denver for Michael Porter Jr., Johnson probably will play a smaller role but should feast on the open looks created by three-time MVP Nikola Jokic. The Nuggets would love if Johnson, who has never played more than 66 games in a season, could surpass that. -- Pelton Signature stat: Last season, Johnson had career highs in points, field goal percentage and assists. He also averaged 50.4 touches, up from 39.5 in 2022-23. Fantasy projection: 17.1 PTS, 4.3 REB, 2.9 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "66",
        "player_name": "Deni Avdija",
        "summary": "2024 NBA Rank: Unranked After a draft-night trade to Portland, Avdija continued his unlikely ascent into a go-to option on offense. Avdija's full-season stats mask some of his development after a slow adjustment to a new system. Starting with his first 20-point game as a Blazer, Avdija averaged 19.1 points, 7.7 rebounds and 4.2 assists from Nov. 29 onward. Included were a pair of triple-doubles, matching the most any Portland player has had in a season since Clyde Drexler. For all of the Blazers' recent lottery picks, Avdija looks like the centerpiece of their rebuilding efforts. -- Pelton Signature stat: Avdija had career highs in points, rebounds, assists and steals last season. He also averaged 24.9 points, 10.6 rebounds and 5.5 assists on 51-43-82 splits in the final 16 games of the season. Fantasy projection: 17.6 PTS, 8.2 REB, 4.2 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "65",
        "player_name": "Aaron Nesmith",
        "summary": "2024 NBA Rank: Unranked As a two-way force on the perimeter during the Pacers' improbable run to the Finals, Nesmith was one of the breakout stars of the postseason. He was often tasked with defending the opposing team's best perimeter players while shooting lights-out as a 3-point shooter on offense. He not only shot 43% from deep during the regular season but caught fire in Game 1 of the Eastern Conference finals while hitting eight 3s to lead Indiana's comeback victory at Madison Square Garden that would propel the Pacers to a series victory. -- Collier Signature stat: Nesmith shot 49.2% on 3s in 2025 playoffs -- the best in a single postseason (minimum 100 attempts). Fantasy projection: 14.0 PTS, 4.6 REB, 1.5 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "64",
        "player_name": "Luguentz Dort",
        "summary": "2024 NBA Rank: 85 For the fourth consecutive season, Dort averaged fewer points, a stat that reflects the Thunder's growth into champions rather than anything he's doing wrong. Oklahoma City would rather Dort focus on locking down wing scorers, a role that earned him All-Defensive first-team honors for the first time and a fourth-place finish in Defensive Player of the Year honors. But Dort has also become a dangerous 3-point shooter, making a career-high 2.4 per game at a 41% clip last season. The combination is an ideal 3-and-D role player to complement the Thunder's stars. -- Pelton Signature stat: He drew 55 offensive fouls -- tied for the second most in the NBA behind Toumani Camara. Fantasy projection: 10.3 PTS, 4.1 REB, 1.1 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "63",
        "player_name": "LaMelo Ball",
        "summary": "2024 NBA Rank: 50 Last season, Ball averaged a career-high 25.2 points but was denied an All-Star nod given his team's dreadful performance, with the Hornets ultimately winning only 19 games. But he nonetheless forms the center of a young core that added Duke swingman Kon Knueppel, one of the best shooters in the 2025 draft. A key question is Ball's availability. He played only 22 games in 2023-24 and 47 last season -- all because of injuries. (He has suffered repeated ankle woes.) But when healthy, he has proved to be one of the more dynamic point guards in the game, both with his scoring, rebounding and passing. As he goes, so go the Hornets. -- Holmes Signature stat: He is the first Hornet to average 25 points and 7 assists in a season. Last season, the team went 3-32 when he sat out 35 games. Fantasy projection: 26.7 PTS, 5.3 REB, 7.9 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "62",
        "player_name": "Christian Braun",
        "summary": "2024 NBA Rank: Unranked The Nuggets' bet on Braun paid off last season, when he averaged career highs of 15.4 points, 5.2 rebounds, 2.6 assists and 1.1 steals after being elevated into the starting lineup following the free agency exit of Kentavious Caldwell-Pope. He shot 58% from the field while making 89 3s -- joining teammate and three-time MVP Nikola Jokic as the only player who had accomplished the feat in a season. The next step for Braun, who shot 39.7% on 3s, is to increase his long-range volume. -- MacMahon Signature stat: He had 196 transition field goals made -- the most since LeBron James (2013-14), per GeniusIQ. Fantasy projection: 15.1 PTS, 5.2 REB, 1.1 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "61",
        "player_name": "Zion Williamson",
        "summary": "2024 NBA Rank: 27 In six seasons in New Orleans, the face of the Pelicans' franchise has played 60 or more games only twice, with on-court and off-court issues derailing his early career. His health and conditioning have long been problematic. He was also sued in May by a woman who alleged that he committed \"sexual, physical, emotional and financial\" abuse over a multiyear relationship. He averaged 24.6 points in 30 games in 2024-25 before he was shut down in March after suffering a lower back bruise. With executive Joe Dumars now leading the Pelicans, perhaps the wildly talented Williamson has a chance for a fresh start, but expectations will be measured given his track record. -- Holmes Signature stat: He was the only player to average 25 points and shoot 60% from the field from Jan. 25 to the end of last season. Fantasy projection: 26.3 PTS, 7.2 REB, 5.5 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "60",
        "player_name": "Austin Reaves",
        "summary": "2024 NBA Rank: 72 Coming off a season in which he posted career-high averages in points (20.2), rebounds (4.5) and assists (5.8) while dutifully catering his game to first fit with LeBron James and Anthony Davis and then James and Luka Doncic on the fly, Reaves is betting on himself for 2025-26. Reaves and his representatives turned down a four-year, nearly $90 million contract extension offer from the Lakers in June, setting himself up to test unrestricted free agency next summer and sign a new deal worth well over $100 million. Not that the Lakers won't be interested in keeping him then, after signing him as a rookie when he went undrafted in 2021. \"He just keeps proving himself over and over and over again,\" Lakers governor Jeanie Buss told ESPN in April. \"We're just lucky to have him.\" -- McMenamin Signature stat: He is the second Lakers player with 200-plus 3s in a season -- joining D'Angelo Russell (2023-24). Fantasy projection: 18.6 PTS, 4.3 REB, 5.5 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "59",
        "player_name": "Jalen Suggs",
        "summary": "2024 NBA Rank: 95 Like the Magic, Suggs is looking to bounce back from an injury-marred season. The tough point guard sat out all but one game after Jan. 3 because of injuries. He would later require season-ending surgery on his left knee. A healthy Suggs is a huge key to the Magic's success with his defense and competitive leadership. He averaged a career-high 16.2 points and 4.0 rebounds in 35 starts. If Orlando is going to realize its full playoff potential, it will need a healthy Suggs. -- Youngmisuk Signature stat: Last season, the Magic went 20-15 with Suggs and 21-26 without him. Suggs, Paolo Banchero and Franz Wagner played together in only six games last season. Fantasy projection: 15.7 PTS, 3.6 AST, 1.5 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "58",
        "player_name": "Trey Murphy III",
        "summary": "2024 NBA Rank: Unranked Like just about everyone on the Pelicans in 2024-25, Murphy's season was affected by injury. In late March, he suffered a torn labrum in his shoulder against the Detroit Pistons that required surgery and ended what had been a breakout season for the then-24-year-old. In only 53 games, Murphy averaged career highs in points (21.2), rebounds (5.1) and assists (3.5) and is widely regarded as one of the best 3-and-D players in the game. -- Shelburne Signature stat: He averaged a career-high 21.2 points, and it was his third season with 150-plus 3s made -- tied for the most in Pelicans history. Fantasy projection: 20.0 PTS, 4.9 REB, 3.2 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "57",
        "player_name": "Myles Turner",
        "summary": "2024 NBA Rank: 81 After playing a critical role in the Pacers' run to the 2025 NBA Finals, Turner leaving Indiana for rival Milwaukee was, perhaps, the most shocking move of the offseason. Turner had become a mainstay with the Pacers, surviving years of trade rumors to transform his game into a strong combination of rim-protecting and floor spacing that was perfect for Indiana's free-flowing offense. He has led the league in blocks per game twice in his career and shot a career-best 39.6% from 3 last season on 5.5 attempts. The Bucks are going to rely heavily on Turner to produce on both ends of the court after paying a hefty price to sign him in free agency. -- Collier Signature stat: One of three players with 700 3s made and 1,400 blocks. Fantasy projection: 17.3 PTS, 7.2 REB, 2.2 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "56",
        "player_name": "Isaiah Hartenstein",
        "summary": "2024 NBA Rank: 88 Hartenstein gave the Thunder exactly what it hoped for in his first season with the team, averaging a double-double (11.2 PPG, 10.7 RPG) for the first time in his career in just under 28 minutes per game. Chet Holmgren's injury issues last season limited the Thunder's ability to deploy a double-big lineup, and even when they were both healthy in the playoffs, the team abandoned the strategy at critical times against the Nuggets and Pacers. So it'll be interesting to see how coach Mark Daigneault and his staff tweak things with Hartenstein and Holmgren in Year 2. -- Shelburne Signature stat: He had career highs in points and rebounds last season, and is the first Thunder player to average 10 points and 10 rebounds since Westbrook (2018-19). Fantasy projection: 10.4 PTS, 10.1 REB, 1.1 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "55",
        "player_name": "Dyson Daniels",
        "summary": "2024 NBA Rank: Unranked Daniels' first season with the Hawks produced a Most Improved Player award, a second-place finish in Defensive Player of the Year voting and All-Defensive first-team honors. The third-year guard averaged 3.0 steals while scoring 14.1 points, grabbing 5.9 rebounds and shooting 34% from 3. All of this was in just his first season as a starter. With Onyeka Okongwu and Kristaps Porzingis' shot-blocking now behind him in the paint, Daniels should have more help and ability to gamble on defense. If his outside shot continues to improve, Daniels could be a top-50 player. -- Youngmisuk Signature stat: Last season, Daniels had 229 steals -- the most since Gary Payton (1995-96) -- and he was the first player to average 3.0 steals since 1990-91. Fantasy projection: 13.7 PTS, 5.9 REB, 2.9 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "54",
        "player_name": "Paul George",
        "summary": "2024 NBA Rank: 21 George's first season in Philadelphia, after being the crown jewel of free agency, saw him play only 41 games as part of a truly depressing season (the only positive was the 76ers being able to keep their first-round draft pick). Now, George is recovering from a knee procedure in July that probably will cause him to sit out the start of the season. -- Bontemps Signature stat: He played 41 games last season, the third fewest in his career. He also averaged 16.2 points, his lowest since 2011-12 (minimum 10 games). Fantasy projection: 18.6 PTS, 5.4 REB, 1.7 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "53",
        "player_name": "Alex Caruso",
        "summary": "2024 NBA Rank: 59 Caruso's statistics never look all that impressive. Last season, he averaged 7.1 points, 2.9 rebounds and 1.6 steals in just 19 minutes. But his impact on the Thunder during their championship run was undeniable. From leadership and basketball IQ to defensive intensity and clutch 3-point shotmaking during the playoffs, Caruso far exceeded expectations as the \"veteran\" leader on the NBA's youngest team. -- Shelburne Signature stat: He had 17 steals in the 2025 NBA Finals -- the most off the bench since steals became an official stat in 1974. Fantasy projection: 7.3 PTS, 3.1 REB, 1.6 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "52",
        "player_name": "Cooper Flagg",
        "summary": "The 18-year-old Flagg, who might be the most anticipated American prospect since LeBron James, arrives in the NBA in a distinctive position of being a No. 1 pick on a veteran-heavy roster with playoff aspirations. Mavs coach Jason Kidd plans to give the 6-foot-9 Flagg plenty of opportunity to prove that he can flourish as a point forward. Kidd took a similar approach with a young Giannis Antetokounmpo in Milwaukee, but the Greek Freak wasn't surrounded by 30-something future Hall of Famers the way Flagg will be in Dallas. -- MacMahon Signature stat: He was the first ACC freshman to lead a team in points, rebounds and assists since freshmen became eligible in 1972-73. Fantasy projection: 19.5 PTS, 6.3 REB, 4.3 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "51",
        "player_name": "Draymond Green",
        "summary": "2024 NBA Rank: 66 Green made his ninth All-Defensive team last season, his fifth time on the first team. He spent the final month campaigning for the Defensive Player of the Year award and, had he won at 35, he would've been the oldest to do it. Green finished third in the voting. He isn't quite the steals hound and rim-protecting leaper he was in his late 20s. But the defensive brain is still powerful, and his impact on that end is enough to keep him among the elite. His offensive limitations handcuff certain lineups. He made a decent 32.5% of his 3s last season, but teams don't guard him on the perimeter. That will continue to be an issue. But the Warriors had the NBA's best defense after the All-Star break -- and he is the key reason. -- Slater Signature stat: Last season he made the All-Defensive team for the ninth time -- the most since entering the NBA in 2012-13. Fantasy projection: 8.9 PTS, 6.3 REB, 5.8 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "50",
        "player_name": "Kristaps Porzingis",
        "summary": "2024 NBA Rank: 46 Health continues to be the biggest question mark for Porzingis, especially at this stage in his career. His performance in the 2025 playoffs was limited by an upper respiratory illness that bothered him both in the regular season and into the second round as he failed to capitalize on a strong run to the Finals with the Celtics in 2024. Now, Porzingis has a chance to make an impact with a fresh start in Atlanta as one of the prized acquisitions of Atlanta's offseason. He remains one of the best stretch bigs in the league -- an elite rim protector and legit threat from 3-point range -- who, if he can remain healthy, could help turn the Hawks into contenders in a weakened conference. -- Jamal Collier Signature stat: Porzingis ranked fifth in effective field goal percentage allowed among defenders contesting 700-plus shots in 2024-25. Fantasy projection: 20.1 PTS, 7.0 REB, 1.6 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "49",
        "player_name": "Rudy Gobert",
        "summary": "2024 NBA Rank: 34 Minnesota finished with the 10th-best defensive rating in the league last season, anchored by Gobert, the four-time Defensive Player of the Year award winner. The things Gobert does well, he does really well: He shot 66.9% from the field, averaged double-digit rebounds for the 10th straight season (10.9 per game) and finished ninth in total blocked shots. It's just the areas where the 7-foot-1 Gobert struggles -- perimeter defense, outside shooting (he's yet to make a 3-pointer in his career) and occasional foul trouble -- that make his game a lightning rod for debate when it comes to determining his true value to a Wolves team with title aspirations. -- Dave McMenamin Signature stat: Opponents shot 57% on layups/dunks with Gobert on the court (3rd) vs. 62% when he was not on the floor (21st). Fantasy projection: 12.0 PTS, 10.8 REB, 1.5 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "48",
        "player_name": "Mikal Bridges",
        "summary": "2024 NBA Rank: 38 It was a volatile season for Bridges in New York after being acquired from the crosstown rival Nets for a boatload of draft picks last summer. Bridges at times was a sore spot for his inconsistent production, but he made huge plays to help the Knicks win two of their four games against the Celtics in the conference semifinals, helping them reach the East finals for the first time in a quarter century. New York will be hoping for more consistency from Bridges this season. -- Tim Bontemps Signature stat: Bridges played in 556 consecutive games, the fourth most to start a career, and could reach second with 54 more games. Fantasy projection: 17.9 PTS, 3.4 REB, 3.7 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "47",
        "player_name": "Joel Embiid",
        "summary": "2024 NBA Rank: 8 It is almost impossible to rank Embiid after the former MVP played just 19 games last season. If he is back and healthy, he's obviously a top-10-caliber player, as he was for several seasons prior to 2024-25. But that's a very big if, particularly after how the past 18 months or so have gone in Philly. -- Bontemps Signature stat: Embiid in 2023-24 became the first player since Wilt Chamberlain (1961-62) with more points than minutes played in a season. Fantasy projection: 27.8 PTS, 9.1 REB, 4.6 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "46",
        "player_name": "Jamal Murray",
        "summary": "2024 NBA Rank: 31 Murray's season started with concerns about his health after a disappointing playoff run and ineffective Olympics. The season ended with Murray averaging a career-high 21.4 points and playing the most games (67) he has since 2018-19. Murray wasn't as dominant in the postseason as he was in Denver's 2023 title run, but he increased his scoring average from the regular season for the fourth time in five playoff runs. He had a monster 43-point game on 17-of-26 shooting against the Clippers in a pivotal Game 5. -- Kevin Pelton Signature stat: Murray's 1,375 points scored/assisted via handoffs over past three seasons are the most in the NBA, per GeniusIQ. Fantasy projection: 21.3 PTS, 6.1 AST, 1.3 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "45",
        "player_name": "Jarrett Allen",
        "summary": "2024 NBA Rank: 73 He was stung when some in the league called him soft after he missed games in the 2024 playoffs, so he sent a message by playing in all 82 games last season and not complaining about a slightly smaller role. He led the NBA in field goal percentage, his rim protection is elite, and he's an A-plus locker room presence. But a couple of dud playoff games at the end left a sour taste and perhaps opened a new lane for motivation. -- Brian Windhorst Signature stat: Allen's five games with 20 points and 90% field goal shooting is tied for second most in the shot clock era; only Wilt Chamberlain had more (11). Fantasy projection: 14.2 PTS, 9.9 REB, 1.0 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "44",
        "player_name": "Jalen Johnson",
        "summary": "2024 NBA Rank: Unranked Johnson was poised for a breakout until a shoulder injury ended his season in January. He averaged 18.9 points, 10.0 rebounds, 5.0 assists and 1.6 steals in 36 games. Now, Johnson and Trae Young will have more help around them with the additions of Kristaps Porzingis and Nickeil Alexander-Walker. If Johnson's progress continues, the Hawks could have a fourth-year veteran on the verge of becoming a top-35 player, which could make the team a serious threat to the Knicks and other contenders in the wide-open East. -- Ohm Youngmisuk Signature stat: Johnson ranked seventh in touches per game as of Jan. 23, part of the only duo with Young in the top 10 in the category. Fantasy projection: 18.0 PTS, 9.7 REB, 1.5 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "43",
        "player_name": "Lauri Markkanen",
        "summary": "2024 NBA Rank: 33 Markkanen had an incredible performance leading Finland to the bronze medal game at EuroBasket -- including an upset of Serbia. But Markkanen didn't quite reach expectations last season in Utah after signing a monster extension in the offseason, playing in just 47 games and averaging 19 points and just 5.9 rebounds for the tanking Jazz. That's as much on the Jazz as it is Markkanen, who reminded everyone this summer just how versatile and dangerous he can be. -- Ramona Shelburne Signature stat: Markkanen's 1,142 career 3-pointers made are the second most by a 7-footer, and he's the only 7-footer with 200 3s in a season (2022-23). Fantasy projection: 21.1 PTS, 6.8 REB, 1.7 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "42",
        "player_name": "Julius Randle",
        "summary": "2024 NBA Rank: 48 Through the first two rounds of the 2025 playoffs, Randle played some of the finest basketball of his 11-year career, averaging 23.9 points on 50.9% shooting with 5.9 rebounds and 5.9 assists per game as the Wolves ousted the Los Angeles Lakers and Golden State Warriors to reach the conference finals. With a trip to the NBA Finals on the line, Randle struggled in two crucial moments against Oklahoma City: six points on 2-for-11 shooting and four turnovers in a loss in Game 2, and five points on 1-for-7 shooting and five turnovers in a loss in Game 4. Minnesota bet that the forward has more to give as Anthony Edwards' running mate, signing the 30-year-old to a three-year, $100 million extension in June. -- McMenamin Signature stat: Randle averaged 21.7 PPG and 50% FG in the 2025 playoffs vs. 17.1 PPG and 34% FG in previous postseason appearances. Fantasy projection: 19.8 PTS, 7.5 REB, 4.6 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "41",
        "player_name": "OG Anunoby",
        "summary": "2024 NBA Rank: 51 Last season was the finest of Anunoby's career, and he played a huge role in New York's impressive run to the conference finals. He has solidified himself as one of the league's best and most versatile defenders and set a career high in points per game (18.0) and tied his career high in games played (74). New York will be hoping both marks carry over to this season, as he will remain a critical part of what the Knicks hope will be a conference-winning squad under Mike Brown. -- Bontemps Signature stat: Anunoby is the first Knicks player with at least 150 3-points made, 100 steals and 50 blocks in a season. Fantasy projection: 17.7 PTS, 4.8 REB, 1.5 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "40",
        "player_name": "Aaron Gordon",
        "summary": "2024 NBA Rank: 49 Gordon played the hero in so many of the Nuggets' playoff games in 2024-25 despite having a frustrating regular season due to injuries. When he was healthy enough to play, he showcased a much-improved 3-point shooting stroke (44%), honed through months of tireless work on his home court. No one was more frustrated than Gordon at the series of calf and leg injuries that caused him to miss 30 regular-season games. If he's able to sustain his health this year, look for new coach David Adelman to allow Gordon to contribute even more offensively. -- Shelburne Signature stat: Gordon had the first game-winning, buzzer-beating dunk in NBA history in Game 4 of the first-round series against the LA Clippers. Fantasy projection: 14.6 PTS, 5.5 REB, 3.3 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "39",
        "player_name": "Desmond Bane",
        "summary": "2024 NBA Rank: 60 For the first time in his career, Bane has a new home. And the Magic are confident that he will be the missing component that helps Orlando go deeper in the playoffs. Bane is a 41% career 3-point shooter who averaged 19.2 points last season, addressing perhaps Orlando's biggest need. Bane is tasked with helping open things up for Paolo Banchero and Franz Wagner with his perimeter shooting, and he can provide leadership with his playoff experience that includes getting to the second round in 2021-22. -- Youngmisuk Signature stat: Bane is one of three players with 800 made 3s and 40% 3-point percentage since 2020-21 (with Zach LaVine and Stephen Curry). Fantasy projection: 20.4 PTS, 6.2 REB, 5.5 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "38",
        "player_name": "Darius Garland",
        "summary": "2024 NBA Rank: 57 A superior season in which Garland returned to the All-Star team after two years away took an unfortunate turn when he suffered a nasty toe sprain late and then reaggravated it in the first round of the playoffs. He was basically playing on one foot after that. It showed in his performance, and it will linger into this year after offseason surgery. But there's a lot to like about how he found comfort in a different role under coach Kenny Atkinson, who built sections of the game around him away from Donovan Mitchell and Evan Mobley. There was a time when Garland's future in Cleveland looked uncertain. For now, that question has been answered. -- Windhorst Signature stat: Garland is one of two players to average at least 20 points, 5 assists and 40% from 3 (with Nikola Jokic). Fantasy projection: 20.4 PTS, 6.8 AST, 1.2 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "37",
        "player_name": "Amen Thompson",
        "summary": "2024 NBA Rank: Unranked Unquestionably one of the most elite talents in the NBA, Thompson is poised to take the next step in his ascension after making the NBA's All-Defensive first team in his second season. Thompson already plays with the intensity Rockets coach Ime Udoka covets. That allowed Thompson last season to become the first player since Charles Barkley in 1993 to post 25 points, 5 steals and 3 blocks in a playoff game. Now, it's all about refining Thompson's skill set, most notably his 3-point shot (27.5% last season). Thompson's tireless work ethic suggests he'll improve there. -- Michael C. Wright Signature stat: Thompson was the first Rockets player with at least 80 steals and 80 blocks since Hakeem Olajuwon (1998-99). Fantasy projection: 14.1 PTS, 8.4 REB, 1.5 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "36",
        "player_name": "Ivica Zubac",
        "summary": "2024 NBA Rank: Unranked Underrated no more, Zubac had a breakout year in his ninth season. And still just 28 years old, he could be settling in for a spectacular prime. In a conference where there are so many talented big men, Zubac has matured into an elite defensive center. He's one of the best offensive rebounders in the league too, and hunts only high-percentage shots, hitting more than 60% in six straight seasons. He has proved he can handle a bigger role, and the Clippers are going to give it to him. -- Windhorst Signature stat: Zubac's 59 double-doubles is the most by a Clippers player since Blake Griffin (2010-11). Fantasy projection: 16.5 PTS, 12.6 REB, 1.2 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "35",
        "player_name": "De'Aaron Fox",
        "summary": "2024 NBA Rank: 26 San Antonio's acquisition of No. 2 pick Dylan Harper left pundits wondering whether the Spurs would break the bank to re-sign Fox to a max contract. Internally, however, there was never a doubt on either side despite the veteran guard playing just five games last season alongside franchise cornerstone Victor Wembanyama. With a full offseason to work with the French phenom, Fox expects the duo to round into a near-unstoppable pick-and-roll combo that will lead arguably the most athletic and versatile Spurs roster since the franchise's dynasty days. -- Wright Signature stat: Fox is one of two players to average 20 points, 5 assists and 1 steal in each of the past six seasons (with Luka Doncic). Fantasy projection: 23.6 PTS, 5.9 AST, 1.5 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "34",
        "player_name": "Domantas Sabonis",
        "summary": "2024 NBA Rank: 29 Sabonis' raw per game production through the past half-decade puts him among the game's elite names. He has finished third, second, first and first in the NBA in rebounds in the past four seasons. Among centers in 2024-25, his 423 assists were behind only Nikola Jokic. Sabonis has averaged at least 18.5 points in the past six seasons. He had a small uptick in 3-point volume last season and made 41% of his 2.2 attempts per game. But he doesn't protect the rim in a fearsome way and has generally needed the ball to be effective while on a Kings team with other ball-dominant players. That strange mix has kept the team out of the playoffs for two straight seasons. -- Anthony Slater Signature stat: Sabonis led the NBA in double-doubles for the third straight season, the first player to do so since Kevin Garnett (2002-07). Fantasy projection: 19.1 PTS, 13.7 REB, 6.7 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "33",
        "player_name": "Ja Morant",
        "summary": "2024 NBA Rank: 20 Morant will probably perceive this ranking as a slight, but he hasn't been an All-Star since the 2022-23 season and has been part of only one playoff series win in his career. Morant's points per game (23.2) and field goal percentage (.454) last season were his lowest since his second year in the NBA. In fairness, Morant played most of the season in an offensive system that didn't cater to his strengths. It shouldn't be a surprise if Morant has a bounce-back season with Tuomas Iisalo, who was known for his creative pick-and-roll schemes in Europe, in his first full year as Memphis' head coach. -- Tim MacMahon Signature stat: Morant is one of six players to average 25 points and seven assists over the past four seasons (he played in just 54% of Grizzlies games). Fantasy projection: 27.2 PTS, 5.4 REB, 8.5 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "32",
        "player_name": "Franz Wagner",
        "summary": "2024 NBA Rank: 52 Wagner is coming off a summer in which he helped Germany win EuroBasket gold. Now, he will try to help Paolo Banchero and the Magic win the East. Orlando made moves to contend in the East, not just this season but for the foreseeable future with the addition of Desmond Bane. Wagner will be a big part of that. He took a step forward last season by increasing his scoring average from 19.7 points in 2023-24 to 24.2. His assists and rebounding averages went up, but his shooting has to improve. Wagner missed 20 straight games last season with an oblique injury. An entirely healthy season from Wagner could lead to bigger things for him and the Magic. -- Youngmisuk Signature stat: Wagner had career highs in points, rebounds, assists and steals last season; he ranks last in eFG% on jumpers with 700-plus attempts over the past two seasons. Fantasy projection: 24.0 PTS, 5.7 REB, 4.7 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "31",
        "player_name": "Jaren Jackson Jr.",
        "summary": "2024 NBA Rank: 55 The Grizzlies' offensive makeover last season suited Jackson, who emerged as an efficient No. 1 option during Ja Morant's frequent absences. After his efficiency faded under the weight of a career-high usage rate during the lost 2023-24 Grizzlies campaign, it bounced back last season as Jackson averaged a career-high 26.8 points per 36 minutes. If Jackson could pair that with his Defensive Player of the Year prime, he'd be a lock for our top 20. But Jackson's defensive impact was more muted as his block rate remained less than half what it was in 2022-23. -- Pelton Signature stat: Jackson was the only player with 1,500 points and 100 blocks in 2024-25. Fantasy projection: 22.7 PTS, 5.9 REB, 1.7 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "30",
        "player_name": "Scottie Barnes",
        "summary": "2024 NBA Rank: 35 An All-Star for the first time at age 22 in the 2023-24 campaign, Barnes took a step back last season. He couldn't maintain career-high 34% 3-point shooting, slipping to 28% beyond the arc (and bringing his career mark to 30%). Those 3s were necessary to propel Barnes' efficiency to league-average levels. On the plus side, Barnes' usage rate (27%) was the highest of his career. Having recently turned 24, Barnes should have more development ahead of him, as well as more help with the addition of Brandon Ingram. -- Pelton Signature stat: Barnes' 1,000 points, 50 blocks and 50 steals in each of his four seasons is tied with Chris Bosh for the most in Raptors history. Fantasy projection: 18.8 PTS, 7.6 REB, 5.7 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "29",
        "player_name": "Trae Young",
        "summary": "2024 NBA Rank: 37 Young finished 14th in scoring at 24.2 points per game, his lowest average since his rookie season in 2018-19. But he distributed the ball even better than Nikola Jokic, leading the league in assists with a career-high 11.6 per game. The result was still missing the playoffs for the second straight season. Atlanta got Young more help, adding Kristaps Porzingis, Nickeil Alexander-Walker and Luke Kennard to join Jalen Johnson, Dyson Daniels, Onyeka Okongwu and Zaccharie Risacher. Atlanta could have enough to challenge the Knicks and other contenders for the East crown, especially if Young is ready to lead the Hawks back to the conference finals for the first time since 2021. -- Youngmisuk Signature stat: Young's 880 assists last season were the most in Hawks history. Fantasy projection: 24.7 PTS, 11.4 AST, 1.2 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "28",
        "player_name": "Tyrese Maxey",
        "summary": "2024 NBA Rank: 19 Even Maxey's incandescent smile lost some shine amid the misery of Philadelphia's lost season, but the guard is unquestionably the player the 76ers will lean on most with both Joel Embiid and Paul George coming off injury-riddled campaigns. One thing to watch: Maxey's 3-point shooting. It dropped from 43% three years ago to 33% last season. -- Bontemps Signature stat: Maxey's five games with 30 points and 10 assists is the most by a Sixers player since Allen Iverson (2006-07). Fantasy projection: 26.0 PTS, 6.0 AST, 1.6 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "27",
        "player_name": "Karl-Anthony Towns",
        "summary": "2024 NBA Rank: 30 Towns' transition from Minnesota to New York was rather seamless despite the shocking, eve-of-training camp blockbuster trade that sent him there. He very quickly developed chemistry with Knicks point guard Jalen Brunson, and the two formed one of the most effective pick-and-roll duos in the league. But opponents learned how to bottled up the Towns-Brunson two-man game, and new coach Mike Brown will be tasked with getting that pick back online as well as featuring Towns in more offensive sets as the Knicks aim to diversify their attack. -- Shelburne Signature stat: Towns is one of two players to average 20 points, 10 rebounds and 40% from 3 (with Nikola Jokic). Fantasy projection: 24.2 PTS, 12.3 REB, 3.1 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "26",
        "player_name": "Derrick White",
        "summary": "2024 NBA Rank: 39 It wasn't long ago that White's omission from this list was a major talking point. Now, he's firmly ensconced inside the top 50, a credit to his development and to his role in all of Boston's winning in recent seasons. With Jayson Tatum out, White -- like Jaylen Brown -- could have a chance to burnish his individual accomplishments, and with an increase in individual stats could have a shot at making his first All-Star team this season. Some of that might depend on whether he can keep a Celtics team that has lost Tatum, Jrue Holiday, Al Horford and Kristaps Porzingis in the playoff mix. -- Bontemps Signature stat: Brown is one of two players to average three made 3s and one block per game (with Victor Wembanyama). Fantasy projection: 16.5 PTS, 5.0 AST, 1.1 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "25",
        "player_name": "Alperen Sengun",
        "summary": "2024 NBA Rank: 54 All the work Sengun put in over the summer in Istanbul paid off on the international stage, with the 23-year-old leading Turkey to the FIBA EuroBasket final on the way to earning all-tournament recognition. Houston's brass wanted Sengun to ramp up his stamina over the summer while focusing on the strongest elements of his post game. He accomplished those goals, placing him in a position to be a dominant force in Houston's devastating double-big lineups. -- Wright Signature stat: Sengun is the second Rockets player to average at least 15 points, 10 rebounds and 4 assists in a season (joining Charles Barkley). Fantasy projection: 19.6 PTS, 10.5 REB, 5.0 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "24",
        "player_name": "Chet Holmgren",
        "summary": "2024 NBA Rank: 32 Holmgren played a major role in Oklahoma City's championship run despite missing three months of the season with a fractured pelvis. He has proved himself as one of the most dominant defensive presences in the NBA, averaging 2.3 blocks per game during his career, and is scratching the surface of his offensive potential as a 7-footer with perimeter shooting touch, ballhandling skills and vision. Oklahoma City went 14-2 when Holmgren scored at least 20 points last season, including the playoffs. -- MacMahon Signature stat: Holmgren led the NBA in FG% allowed on layups/dunks among players contesting 100-plus shots. Fantasy projection: 17.0 PTS, 8.9 REB, 2.5 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "23",
        "player_name": "James Harden",
        "summary": "2024 NBA Rank: 41 At age 35, Harden played his most games in seven seasons, averaged his most points in four years, made his first All-Star Game in three years and returned to the All-NBA team for the first time since 2020. The Clippers had a pleasantly surprising season that almost led to a first-round upset of the Nuggets. This summer, he signed a new contract that allows him to become a free agent in 2026, incentivizing him to do it again. He has his limitations at this point in his career, and his efficiency took a hit last season, but this has been a positive LA story. -- Windhorst Signature stat: Harden was the only player with at least 1,500 points, 500 assists, 100 steals and 50 blocks last season. Fantasy projection: 20.7 PTS, 5.3 REB, 8.1 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "22",
        "player_name": "Pascal Siakam",
        "summary": "2024 NBA Rank: 42 Chosen MVP of the Eastern Conference finals after averaging 24.8 PPG and shooting 10-of-20 on 3s in the Pacers' win over the New York Knicks, Siakam has been the missing element for Indiana. Alas, the puzzle might not fit as well without All-Star point guard Tyrese Haliburton running the show this season after his Achilles rupture. Without Haliburton and the departed Myles Turner, the Pacers will rely even more heavily on Siakam's ability to create offense. That could take away from the efficiency he showed last season (including a career-high 39% on 3s) and his versatile defense. -- Pelton Signature stat: The Eastern Conference finals MVP scored 472 points in the postseason -- third most in Pacers history. Fantasy projection: 22.5 PTS, 7.6 REB, 4.1 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "21",
        "player_name": "Bam Adebayo",
        "summary": "2024 NBA Rank: 18 Bounced out of the first round for two straight seasons (including an embarrassing sweep by the Cleveland Cavaliers in the spring), Miami is ready for a reset. Having turned the page from Jimmy Butler III, Miami looks to Adebayo to lead a retooled team and get the Heat's culture back on track. With Norman Powell, Kasparas Jakucionis and Simone Fontecchio on board to help Tyler Herro on offense, Adebayo will seek to return to being the player he was the previous two seasons when he helped Miami reach the NBA Finals in 2023 and was a Defensive Player of the Year candidate, All-Star and defensive first-teamer in 2024. -- Youngmisuk Signature stat: Adebayo took 221 3s last season, up from 104 in his first seven seasons combined, and shot 44% from 3 over the final 36 games. Fantasy projection: 18.8 PTS, 9.9 REB, 4.3 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "20",
        "player_name": "Kawhi Leonard",
        "summary": "2024 NBA Rank: 22 The main question surrounding Leonard entering any season is his health and availability. But the even bigger question this season is the NBA investigation surrounding the $28 million sponsorship deal for a \"no-show\" job that Leonard allegedly had with a now-bankrupt company that Clippers owner Steve Ballmer invested in. This marks yet another off-court issue surrounding Leonard, and it could prove to be a distraction for him and the team, especially if the NBA is able to uncover evidence that leads to severe penalties, which could include Leonard's contract being voided.  -- Baxter Holmes Signature stat: Leonard scored 20-plus points in the final 22 games of the season (regular season and playoffs), tying his career-best streak. Fantasy projection: 21.9 PTS, 6.0 REB, 1.6 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "19",
        "player_name": "Jaylen Brown",
        "summary": "2024 NBA Rank: 14 With Jayson Tatum sidelined for the season with an Achilles tear, Brown will have a chance to see what life is like as the leading scorer in Boston -- with all of the responsibility that comes along with it. Presuming he has no lingering issues from offseason knee surgery, Brown could easily surpass his career high in scoring (26.6 PPG in 2022-23). Still, it remains to be seen how competitive this season's Celtics squad will be, even in the lesser Eastern Conference. -- Bontemps Signature stat: Brown finished with a career high in assists; the Celtics had a 66% effective field goal percentage off his passes, fourth best among those with 500-plus assist opportunities. Fantasy projection: 24.9 PTS, 6.2 REB, 4.2 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "18",
        "player_name": "Jimmy Butler III",
        "summary": "2024 NBA Rank: 28 The drama to close his Miami chapter kept him off the court for the majority of last season. His Warriors stint was short -- 30 regular-season games, 11 playoff games -- but spectacular in all the impact metrics. Most notably: winning. The Warriors were 25-26 when he arrived. They finished on a 23-8 sprint and beat the second-seeded Rockets in the first round. Butler's hard fall on his tailbone in that series sapped some of his pop the rest of the playoffs, but word from those around Butler is that he has had an extremely motivated summer of work, and they expect him to come out of the gate steaming. The question for Butler and his post-prime teammates is how their bodies progress over the 82-game grind. -- Slater Signature stat: The Warriors went 23-7 with Butler vs. 25-27 without him; they had the third-best NBA record after his debut Feb 8. Fantasy projection: 18.5 PTS, 5.4 AST, 1.4 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "17",
        "player_name": "Paolo Banchero",
        "summary": "2024 NBA Rank: 24 Banchero is a top-20 player, but Orlando is banking on its All-Star being ready to take a significant leap forward. The Magic signed Banchero to a five-year, $239-million max rookie extension this past summer and worked to surround him with his best supporting cast yet, adding Desmond Bane's scoring and much-needed outside shooting to give Banchero and Franz Wagner more space to operate. Tyus Jones adds depth and insurance at point guard behind Jalen Suggs. Banchero has improved statistically in each of his first three seasons, raising his scoring average to 25.9 PPG last season after missing 34 games with an oblique injury. If the Magic are going to get out of the first round and contend for the East, Banchero will have to stay healthy and take another step forward. -- Youngmisuk Signature stat: Banchero is the third Magic player to average 25-plus PPG, joining Shaquille O'Neal and Tracy McGrady. Fantasy projection: 24.8 PTS, 8.1 REB, 5.1 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "16",
        "player_name": "Devin Booker",
        "summary": "2024 NBA Rank: 15 Booker spent the first five seasons of his Phoenix career morphing into a respected high-volume scorer on an irrelevant lottery team. Then Chris Paul arrived, and Booker, surrounded by better talent, scaled up his scoring, sharpened other areas of his game and proved he could shine as a major contributor on a perennial winner. Booker, 28, has made four All-Star teams and appeared in 47 playoff games. He just signed a mega-extension in Phoenix. This should be his apex. But the surrounding talent is relatively bleak again. Kevin Durant and Bradley Beal are gone. Booker is the unquestioned best player on a team that many believe isn't playoff-caliber. If it defies expectations, he will presumably be the main reason. -- Slater Signature stat: Booker is one of two players to average 25-plus points in each of the past seven seasons (with Giannis Antetokounmpo). Fantasy projection: 28.0 PTS, 4.2 REB, 7.0 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "15",
        "player_name": "Donovan Mitchell",
        "summary": "2024 NBA Rank: 17 If this ranking seems low for a player who made the All-NBA first team in 2024-25, it perhaps reflects that Mitchell, despite piling up impressive regular seasons, carries a stigma for never leading a team past the second round of the playoffs. Yes, he averaged 34 points in the series loss to the Pacers last season, but he shot 11-of-36 over the final two games as the Cavs went out, a position Mitchell has found himself in before. What can be said is this: Mitchell knows exactly what is expected of him and embraces that reality. -- Windhorst Signature stat: Mitchell is the first guard since Allen Iverson to average 20-plus points per game in his first eight seasons. Fantasy projection: 24.6 PTS, 5.0 AST, 1.4 STL",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "14",
        "player_name": "Anthony Davis",
        "summary": "2024 NBA Rank: 13 The entire spectrum of the AD experience was on display during Davis' Mavs debut. He was brilliant on both ends of the floor for 2½ quarters and then went down in a heap in the middle of the paint, suffering an injury initially believed to be minor that ended up sidelining the 10-time All-Star for the next six weeks. When Davis is healthy, there are few players who have the blend of offensive production and defensive impact. -- MacMahon Signature stat: Davis averaged at least 20 points, 1 steal and 2 blocks in a season for the 11th time in his career in 2024-25, second most by any player since blocks and steals became official in 1973-74. Only Hakeem Olajuwon has more such seasons. Fantasy projection: 26.0 PTS, 12.5 REB, 2.3 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "13",
        "player_name": "Evan Mobley",
        "summary": "2024 NBA Rank: 47 The leap happened. Mobley made All-NBA and won Defensive Player of the Year in his fourth season. The Cavs went all-in on his ascent as a franchise mission last season, and he held up his part. But he now lives in a world of high-end expectation, which this ranking crystallizes, and he is going to be expected to truly show what it means to be a superstar: uplifting your team in the playoffs. That part hasn't happened yet. -- Windhorst Signature stat: Mobley was one of two players to make both All-NBA and All-Defense last season, along with Jalen Williams. Fantasy projection: 18.0 PTS, 9.3 REB, 1.6 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "12",
        "player_name": "Cade Cunningham",
        "summary": "2024 NBA Rank: 67 In his first taste of postseason basketball, Cunningham absolutely looked up to the task. The young Pistons took a major step forward with a tough first-round playoff series that ultimately ended in a loss to the Knicks. Cunningham was at the forefront of Detroit's turnaround last season, which led to his rise up this list. With more talent surrounding him on the roster, Cunningham looked like the star Detroit envisioned when it selected him No. 1 in 2021, as he earned a spot in the All-Star Game for the first time while averaging 26.1 points, 9.1 assists and 6.1 rebounds. The playoffs are a learning curve for any young star, and Cunningham was no exception, but he'll be worth watching this season to see how he continues to evolve after his first experience playing meaningful NBA games. -- Collier Signature stat: Cunningham averaged career highs across the board last season while becoming the first Pistons player to average 25 points and nine assists in a season. Fantasy projection: 26.5 PTS, 6.0 REB, 9.2 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "11",
        "player_name": "Jalen Williams",
        "summary": "2024 NBA Rank: 44 Williams, a mid-major prospect who flew under the radar until late in the draft process, has improved by leaps and bounds in each of his three NBA seasons, elevating to elite status in his third year. His contributions to the Thunder's title run -- especially his 40-point performance in the pivotal Game 5 of the NBA Finals -- would have been impressive under any circumstances. The fact that he played the entire postseason with torn ligaments in his shooting wrist that required surgery, never uttering a peep of complaint, will forever be part of the franchise's lore. -- MacMahon Signature stat: On top of averaging a career-high 21.6 points last season, Williams led the NBA in points per direct isolation allowed and ranked top-five in points per direct drive allowed, per GeniusIQ. Fantasy projection: 22.0 PTS, 5.4 REB, 5.2 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "10",
        "player_name": "Jalen Brunson",
        "summary": "2024 NBA Rank: 12 Last season brought Brunson's second consecutive All-Star and All-NBA second-team selections. In just three years, Brunson has moved himself onto the short list of the best players ever to wear the blue and orange. That also included leading the Knicks to the Eastern Conference finals for the first time in 25 years and to a third straight year with at least one playoff series victory, which hadn't happened since the glory days of the 1990s and early 2000s. The only acceptable outcome for Brunson and the Knicks this season, though, is to fully break through and reach the NBA Finals for the first time this century. Biggest question: How will Brunson adjust to new head coach Mike Brown? For the past three years, Brunson's meteoric ascent to superstardom in New York has been associated with Tom Thibodeau, with whom there was a clear bond of trust and admiration. Thibodeau has had a long run of success with building offenses around small guards and Brunson took the chance to become the leader of his own team with the Knicks and ran with it. Brunson is a tremendous player, of course, and will remain a focal point of the Knicks' offense. However, Brown has talked about both playing much faster and incorporating more ball movement into his offense in New York, much like he did with Sacramento the past few seasons. Brunson, on the other hand, has seemed to prefer playing at a slower pace, and the ball has constantly been in his hands under Thibodeau. It will be interesting to see how this relationship manifests itself over the coming months. But make no mistake: Brunson is still the straw that stirs the drink in Gotham, and he, more than anyone else, will be the one to determine whether the Knicks can break their 26-year Finals drought next spring. -- Tim Bontemps Signature stat: Brunson averaged a career-high 7.3 assists last season. He also became the first player to average 25 points and seven assists in a season in Knicks history. Fantasy projection: 26.3 PTS, 3.0 REB, 7.2 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "9",
        "player_name": "Kevin Durant",
        "summary": "2024 NBA Rank: 9 The Rockets entered last postseason pondering whether they needed to acquire a go-to offensive engine and received an answer resoundingly by way of a first-round exit. Enter Durant, who heads into 2025-26 ranked eighth all time in scoring (30,571 points) just behind Wilt Chamberlain (31,419). Even as he's about to turn 37, Durant remains an efficient and elite scorer who brings championship experience and IQ to go with a relentless work ethic, which is sure to rub off on Houston's relatively young roster. Biggest question: Does Durant's arrival make the Rockets legitimate contenders? Yes, but only if Houston's supporting cast does its part in helping Durant find his fit within the group. Having worked with Durant during his tenure in Brooklyn, Rockets head coach Ime Udoka knows the 15-time All-Star isn't the type of player who wants teammates to defer to him unnecessarily. Durant wants to be integrated into the group naturally, which in turn diversifies Houston's options for attacking opponents. So, the best way to maximize Durant's potential impact is continued growth from players such as Amen Thompson, Reed Sheppard, Jabari Smith Jr. and Alperen Sengun, who spent a good chunk of the summer in Istanbul, Turkey, working with Rockets developmental staffers on whittling down his post moves to focus on what's most effective. Durant has already told teammates to be themselves, and he'll find a way to fit in that best helps the team. Durant's vast experience in a variety of systems over the years ensures he'll find his way; it's just a matter of how quickly. -- Michael C. Wright Signature stat: Kevin Durant has averaged at least 25 points, 50% shooting and 40% on 3-pointers in three straight seasons, the longest streak in NBA history. Fantasy projection: 24.9 PTS, 5.8 REB, 4.2 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "8",
        "player_name": "LeBron James",
        "summary": "2024 NBA Rank: 7 James dropped one spot from No. 7 to No. 8 after a very strong 22nd season during which he averaged 24.4 points, 8.2 assists and 7.8 rebounds, was named to the All-NBA second team and finished sixth in MVP voting. He has already shown unprecedented late-career production and will become the first player ever to play 23 seasons when he steps on the floor this fall. His NBA Rank prominence is unprecedented, too: fellow all-time great Kobe Bryant fell to No. 93 at the start of his 20th and final season in 2015-16. Biggest question: Is this the last we see of James in a Lakers uniform? While James has built his career following a personal ethos to \"become comfortable being uncomfortable,\" the tension between James and the Lakers ratcheted up to another level this summer when his agent, Rich Paul of Klutch Sports, told ESPN's Shams Charania, \"We do want to evaluate what's best for LeBron at this stage in his life and career,\" after the four-time MVP opted into his $52.6 million contract for next season. The statement opened the door for a wave of speculation about whether James wanted to be in L.A., despite the contract decision -- teams such as Dallas, Cleveland and New York were tossed around as potential trade destinations. Paul clarified to ESPN that he never addressed a trade with the Lakers on James' behalf and since the 40-year-old veteran has a no-trade clause in his contract, it would require his side to initiate the dialogue. The rhetoric has died down in the months since as James posted about crack-of-dawn workouts and cheering on Luka Doncic at EuroBasket on his Instagram account. James enters into an unprecedented NBA season with Doncic there to pass the Lakers torch to; his son, Bronny, as his teammate to relish the time with; and four titles and 40,000 points already on his résumé. The better question might be if this is the last we'll see of James in the league at all, and what's left for him to accomplish? -- Dave McMenamin Signature stat: James is heading into his 23rd season, passing Vince Carter for the most in NBA history. With 50 games played, he will pass Robert Parish for the most games played all time. Fantasy projection: 24.9 PTS, 7.7 REB, 8.2 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "7",
        "player_name": "Stephen Curry",
        "summary": "2024 NBA Rank: 6 Despite defenses selling out to an abnormal degree to give him zero space and keep the ball out of his hands, Curry hit 311 3s in 70 games last season. It was Curry's sixth career season with at least 300 makes from deep. Nobody else in league history has done it more than once. So he still possesses the perimeter power that has made him one of the greats in the sport's long history. He will bend coverages and be the center of every defensive game plan when he is on the floor this season. The Warriors' success also remains tied to him. When he was on the floor last season, they outscored opponents by a team-best 299 points. When he was off the floor, they were outscored by a team-high 28 points. With him, they eliminated the 52-win Rockets in the first round and took a 1-0 lead on the Timberwolves in the semis. After he injured his hamstring in Game 1 and sat out, the Warriors lost four consecutive games and were eliminated. Biggest question: What is a potential concern for the 16-season veteran? The hamstring strain was Curry's first soft tissue injury since an adductor strain in November 2018. After healing relatively quickly, Curry even thought he could return for Game 6 of the series, had it been extended that long. He competed in a celebrity golf tournament in Lake Tahoe two months later and reported his body feeling 100 percent. He is known for having a disciplined workout routine and an obsession with keeping his body in shape for the season. But Curry will also turn 38 in March, and everyone around the Warriors knows his workload must be closely monitored if they want him fresh come playoff time. However, that's always difficult when chasing every win for seeding purposes. -- Anthony Slater Signature stat: Curry made at least 300 3-pointers in a season for the sixth time in his career in 2024-25. All other players in NBA history have four combined seasons with at least 300 3-pointers. Fantasy projection: 25.1 PTS, 4.5 REB, 5.8 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "6",
        "player_name": "Anthony Edwards",
        "summary": "2024 NBA Rank: 10 By almost every measure, Anthony Edwards got better last season. He led the league with 320 made 3-pointers at a career-high 39.5% clip. He raised his scoring average from 26 points per game to 28. And, most importantly, he led the team back to the Western Conference finals despite the offseason trade of All-Star center Karl-Anthony Towns. But he would be the first person to tell you he came up short of his goals last season. After losing in five games to the Thunder, Edwards said \"no one would work harder\" than him to improve this offseason. Edwards saw firsthand how Oklahoma City was a better team, with more depth, skill and tactics that were able to take him out of games. To ascend to the heights predicted for him since his star turn with USA Basketball in 2023, Edwards will need to diversify his offensive game and elevate his teammates. Biggest question: Will his penchant for getting technical fouls and being fined by the NBA continue? Edwards led the league with 18 technical fouls last season and was fined over $400,000 by the NBA for a variety of behaviors: obscene gestures, explicit language, and failing to leave the court after an ejection. Not exactly great for his image and candidacy as the future face of the league and the best American-born star. But also not great for his reputation with referees in the league, and sometimes a needless distraction to his team. -- Ramona Shelburne Signature stat: Led by his league-best 320 made 3-pointers, Anthony Edwards averaged 27.6 points last season, the most in a season in Timberwolves history. Fantasy projection: 27.8 PTS, 5.8 REB, 4.7 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "5",
        "player_name": "Victor Wembanyama",
        "summary": "2024 NBA Rank: 11 Wembanyama certainly looks like he's ready to roll. The San Antonio Spurs recently visited Ingram Tom Moore High School, an area hit hard by devastating floods that swept through the Texas Hill Country back in July, and Wembanyama led the team through an abbreviated workout in front of the students. Tossing the basketball off the backboard, Wembanyama jumped to catch it before putting it through his legs and slamming home a thunderous dunk that whipped the spectators into a frenzy. Wembanyama made it look easy. Biggest question: Will Wembanyama's whirlwind summer pay dividends this season? It should. After sitting out the final 30 games of last season because of deep vein thrombosis, Wembanyama received a clean bill of health in July during a busy summer in which the 21-year-old trained for 10 days at a Shaolin temple in Zhengzhou, China, and worked with Hall of Fame big men Kevin Garnett and Hakeem Olajuwon. It's a safe bet that Wembanyama's work with Garnett will instill a little more aggressiveness into the Frenchman's game, while Olajuwon likely schooled the third-year Spur in the sweet footwork and post moves that made the 12-time All-Star virtually unstoppable for 18 seasons in the NBA. Wembanyama believes that some of the moves performed during his Kung Fu training in China mimic what he'll be doing on the court. -- Wright Signature stat: Victor Wembanyama became the third player with a 5x5 game, a 10-block game and a 50-point game in the same season since blocks/steals became official in 1973-74, joining 1992-93 David Robinson and 1989-90 Hakeem Olajuwon. Fantasy projection: 24.7 PTS, 11.5 REB, 4.0 BLK",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "4",
        "player_name": "Giannis Antetokounmpo",
        "summary": "2024 NBA Rank: 3 Antetokounmpo is coming off a season in which he averaged a 30-point double-double and finished second in the league in scoring, behind only SGA. If the Bucks had finished higher in the standings, he would have gotten more MVP love, but he still secured a top-four finish in voting for the seventh consecutive season. Milwaukee's dominant big man is showing no signs of slowing down, reinventing his game by trading in 3s for more midrange jumpers, and it has made him even more efficient. Antetokounmpo remains, perhaps, the league's premier two-way threat, but he hasn't played in even the conference semifinals since 2022. Biggest question: Still in the prime of his career, can Antetokounmpo win another championship in Milwaukee? Antetokounmpo has been putting up even better production over the past few years than the seasons when he won back-to-back MVP awards. He has averaged 30 points, 11 rebounds and 6 assists on 60% shooting in each of the past two seasons, the only player in NBA history to do so, with a combination of efficiency and dominance that rivals peak Shaquille O'Neal and Wilt Chamberlain. Antetokounmpo was healthy for the 2025 playoffs for the first time in three years, and his numbers got even better (33 PPG and 14 RPG on 64% shooting). The Bucks still lost in the first round for the third consecutive season, however. Antetokounmpo has long repeated that winning another championship is the top priority for him, but despite his status as one of the most dominant players of his generation, Milwaukee has faded further away from championship contention. It brings Antetokounmpo's future into the forefront of his 2025-26 season. He will turn 31 in December, and if the Bucks can not put a contender around him, how much longer will Antetokounmpo continue to be patient? -- Jamal Collier Signature stat: Antetokounmpo has averaged 30 points, 10 rebounds, 5 assists and 60% shooting in each of the past two seasons. No other player has done this once in NBA history. Fantasy projection: 31.5 PTS, 12.2 REB, 6.5 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "3",
        "player_name": "Luka Doncic",
        "summary": "2024 NBA Rank: 2 Doncic changed teams but barely budged from his position near the top of NBA Rank from last year, sliding from No. 2 to No. 3. The 26-year-old is coming off a successful summer during which he slimmed down, inked a three-year, $165 million contract extension with L.A. and led Slovenia all the way to the quarterfinals of EuroBasket while pouring in 34.7 points per game in the tournament. Last season was the first time since Doncic was a rookie that the 6-6 guard didn't receive any votes for MVP, as a calf injury, plus the midseason trade, limited him to a career-low 50 games. NBA Rank voters are banking on Doncic to resume his Dallas trajectory now that he's committed to the Lakers. Biggest question: Did Doncic's dominant summer set up an MVP season? First, he transformed his body with a rigorous workout and dietary regimen. Then he signed a three-year, $165 million contract extension with the Lakers. And he topped it all off by leading Slovenia to the quarterfinals at EuroBasket, averaging 34.7 points per game in the international competition. A year ago, Doncic was coming off a surprise run to the NBA Finals with the Mavericks and was considered the best young basketball player in the game. After a season of upheaval, marred by a lengthy calf strain injury and a shocking trade to the Lakers, Shai Gilgeous-Alexander took that title from him, being named MVP and Finals MVP while leading the Thunder to the championship. Is the 26-year-old Doncic -- with the third-highest regular-season scoring average and second-highest postseason scoring average in league history -- ready to continue his trajectory and earn his first MVP along the way? -- McMenamin Signature stat: Luka Doncic led the Lakers in average points, rebounds, assists, steals and 3s after making his debut with the Lakers on Feb. 10. Fantasy projection: 30.1 PTS, 8.5 REB, 8.2 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "2",
        "player_name": "Shai Gilgeous-Alexander",
        "summary": "2024 NBA Rank: 4 Scoring champion, MVP, Western Conference finals MVP, Finals MVP, champion. It isn't hyperbole to declare that Gilgeous-Alexander's 2024-25 season ranks among the best individual campaigns in the history of the game. And he's just entering his prime at 27. Biggest question: How can SGA continue to improve? He has steadily become a more efficient scorer and had a career-best 63.7% true shooting percentage last season, when he made and attempted by far the most 3s (163 of 435, 37.5%) of his career. Continuing to expand his range will make him even more difficult to defend. He has also shown steady progress as a playmaker, averaging a career-best 6.4 assists, a number that could increase again as his young supporting cast blossoms as scoring options. -- Tim MacMahon Signature stat: Shai Gilgeous-Alexander became the fourth player to win the scoring title, NBA MVP and NBA title in the same season in league history, along with Shaquille O'Neal, Michael Jordan and Kareem Abdul-Jabbar. Fantasy projection: 33.2 PTS, 5.2 REB, 6.5 AST",
        "source": "ESPN NBA Rank 2025-26"
    },
    {
        "rank": "1",
        "player_name": "Nikola Jokic",
        "summary": "2024 NBA Rank: 1 This is the second consecutive year Jokic has led ESPN's NBA Rank, and it's easy to see why. Yes, Oklahoma City's Shai Gilgeous-Alexander was a well-deserving winner of the league's regular-season and Finals MVP awards. And yes, he beat Jokic head-to-head in the playoffs. But even the Thunder will tell you that Jokic had some otherworldly games in that series, and they were fortunate to advance out of that fight of a second-round series. Simply put, Jokic is at the peak of his basketball powers right now and should be regarded as an MVP favorite as long as he stays at this level. Last season, Jokic became the third player in history to average a triple-double (29.6 points, 12.7 rebounds and 10.2 assists) for the season and had the fourth-highest player efficiency rating (32.04) in league history. He finished as the runner-up to Gilgeous-Alexander largely because the Thunder were so much better as a team than the dysfunctional Nuggets, who fired their coach and general manager at the end of the regular season and underachieved with a fourth-place Western Conference finish. Biggest question: Have the Nuggets done enough to build out the depth issues that plagued them last season? Part of the reason Jokic's numbers were so incredible is that the Nuggets needed him to carry such a heavy load after a second straight offseason of losing key players from their championship team. This season, Denver has been more aggressive in surrounding Jokic with more talent and a deeper bench, but we won't know until we see this new group out there whether those moves will look as good as they do on paper. If Denver rebounds and challenges the Thunder as the best team in the West, Jokic has a chance to become only the sixth player in NBA history to win four MVP awards, joining Kareem Abdul-Jabbar, Michael Jordan, Bill Russell, Wilt Chamberlain and LeBron James. -- Shelburne Signature stat: Last season, Jokic became the third player to average a triple-double in a season in NBA history, joining Oscar Robertson in 1961-62 and Russell Westbrook (4x). Fantasy projection: 29.0 PTS, 12.7 REB, 10.1 AST",
        "source": "ESPN NBA Rank 2025-26"
    }
]